#!/usr/bin/ruby
# -*- coding: UTF-8 -*-
# author: liupeng
# fileName: string.rb
# #
#                       _oo0oo_
#                      o8888888o
#                      88" . "88
#                      (| -_- |)
#                      0\  =  /0
#                    ___/`---'\___
#                  .' \\|     |# '.
#                 / \\|||  :  |||# \
#                / _||||| -:- |||||- \
#               |   | \\\  -  #/ |   |
#               | \_|  ''\---/''  |_/ |
#               \  .-\__  '-'  ___/-. /
#             ___'. .'  /--.--\  `. .'___
#          ."" '<  `.___\_<|>_/___.' >' "".
#         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
#         \  \ `_.   \_ __\ /__ _/   .-` /  /
#     =====`-.____`.___ \_____/___.-`___.-'=====
#                       `=---='
#
#     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#
#               佛祖保佑         永无BUG
#

str = String.new("wesrxdctfvygbuh")
#返回一个包含 integer 个 str 的新的字符串。换句话说，str 被重复了 integer 次。
str = str * 3
puts str

number = 234
str = "" << number
puts str

# 进行比较，返回 -1（小于）、0（等于）或 1（大于）。比较是区分大小写的。
puts "abc" <=> "bcd"
